#include "Model.h"

#include <cassert>

#include "Base/System/System.h"
#include "Base/WinApp/WinApp.h"
#include "Base/DirectXCommon/DXCommon.h"

///-------------------------------------------/// 
/// コンストラクタ、デストラクタ
///-------------------------------------------///
Model::Model() = default;
Model::~Model() {}


///-------------------------------------------/// 
/// 初期化
///-------------------------------------------///
void Model::Initialize(BlendMode mode) {

}


///-------------------------------------------/// 
/// 更新
///-------------------------------------------///
void Model::Update() {

}


///-------------------------------------------/// 
/// 描画
///-------------------------------------------///
void Model::Draw() {

}
