#include "Ground.h"

///-------------------------------------------/// 
/// デストラクタ
///-------------------------------------------///
Ground::~Ground() {
	object3d_.reset();
}

///-------------------------------------------/// 
/// 初期化
///-------------------------------------------///
void Ground::Initialize() {
	AABBCollider::Initialize();
	//aabb_.min = {};
	//aabb_.max = {};

	// object3dの初期化
	object3d_ = std::make_unique<Object3d>();
	object3d_->Init(ObjectType::Model, "GameGround");
	SetScale({ 0.5f, 0.5f, 0.5f });
	object3d_->Update();
}

///-------------------------------------------/// 
/// 更新
///-------------------------------------------///
void Ground::Update() {
	// 更新
	object3d_->Update();
}

///-------------------------------------------/// 
/// 描画
///-------------------------------------------///
void Ground::Draw() {
	// 描画
	object3d_->Draw();
}

///-------------------------------------------/// 
/// 衝突判定
///-------------------------------------------///
void Ground::OnCollision(Collider * collider) {}
