#include "LongRangeEnemeyBullet.h"

///-------------------------------------------/// 
/// デストラクタ
///-------------------------------------------///
LongRangeEnemeyBullet::~LongRangeEnemeyBullet() {

}

///-------------------------------------------/// 
/// 初期化
///-------------------------------------------///
void LongRangeEnemeyBullet::Initialize() {

}

///-------------------------------------------/// 
/// 更新
///-------------------------------------------///
void LongRangeEnemeyBullet::Update() {

}

///-------------------------------------------/// 
/// 描画
///-------------------------------------------///
void LongRangeEnemeyBullet::Draw(BlendMode mode) {

}

///-------------------------------------------///  
/// 衝突判定
///-------------------------------------------///
void LongRangeEnemeyBullet::OnCollision(Collider * collider) {

}
